Revit 2026 API

# PropertySetElementGetThermalAsset Method

---

Gets a copy of the ThermalAsset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ThermalAsset GetThermalAsset()
```
```vb
Public Function GetThermalAsset As ThermalAsset
```
```cpp
public:
ThermalAsset^ GetThermalAsset()
```
```fsharp
member GetThermalAsset : unit -> ThermalAsset
```

#### Return Value

ThermalAsset

#### Reference

PropertySetElement Class

Autodesk.Revit.DB Namespace